In [53]:
import pandas as pd

In [54]:
df_sample1 = pd.read_csv('C:/Users/mayan/sample.txt', sep = "\t", encoding="utf-8") 
df_sample2 = pd.read_csv('C:/Users/mayan/sample.txt', sep = "\t", encoding="utf-8", header=None)

In [55]:
df_sample1

Empty DataFrame
Columns: [Mayank, Ekta, Dousik, 8.99999999, 100.0000001, 987]
Index: []

In [56]:
df_sample2

        0     1       2    3      4    5
0  Mayank  Ekta  Dousik  9.0  100.0  987

In [75]:
df_sample3 = pd.read_csv('sample.txt') 
df_sample3_1 = pd.read_csv('sample.txt', index_col=False) 
df_sample4 = pd.read_csv('sample.txt', index_col=False, header=None)

In [76]:
df_sample3

Empty DataFrame
Columns: [Mayank	Ekta	Dousik	8.99999999	100.0000001	987]
Index: []

In [77]:
df_sample3_1

Empty DataFrame
Columns: [Mayank	Ekta	Dousik	8.99999999	100.0000001	987]
Index: []

In [78]:
df_sample4

                                                   0
0  Mayank\tEkta\tDousik\t8.99999999\t100.0000001\...

In [72]:
df_sample5 = pd.read_csv('sample.txt', sep = "\t", header=None, names=["Name1","Name2","Name3","a", "b", "c"])
df_sample6 = pd.read_csv('sample.txt', sep = "\t", header=None, names=["Name1","Name2","Name3","a", "b", "c"], index_col=False)

In [73]:
df_sample5

    Name1 Name2   Name3    a      b    c
0  Mayank  Ekta  Dousik  9.0  100.0  987

In [74]:
df_sample6

    Name1 Name2   Name3    a      b    c
0  Mayank  Ekta  Dousik  9.0  100.0  987